In [2]:
from sqlalchemy import create_engine, text
import pandas as pd

In [3]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost:5432/final_project'


# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

#### Query 1: Which store generates the most revenue and profit each month?

In [10]:
q1 = '''

WITH StoreMetrics AS (
    SELECT 
        s.store_id,
        s.store_name,
        EXTRACT(YEAR FROM t.tran_time) AS year,
        EXTRACT(MONTH FROM t.tran_time) AS month,
        TO_CHAR(t.tran_time, 'Month') AS month_name,
        SUM(sdi.quantity * sdi.actual_unit_price) AS total_revenue,
        SUM(sdi.quantity * (sdi.actual_unit_price - COALESCE(pp.actual_unit_cost, 0) - COALESCE(sdi.discount_amount, 0))) AS total_profit
    FROM stores s
    JOIN transactions t ON s.store_id = t.store_id
    JOIN sales_detailed_item sdi ON t.transaction_id = sdi.transaction_id
    LEFT JOIN inventory_lot il ON sdi.lot_id = il.lot_id
    LEFT JOIN purchase_product pp ON il.purchase_product_id = pp.purchase_product_id
    GROUP BY s.store_id, s.store_name, EXTRACT(YEAR FROM t.tran_time), EXTRACT(MONTH FROM t.tran_time), TO_CHAR(t.tran_time, 'Month')
),
RankedMetrics AS (
    SELECT 
        year,
        month,
        month_name,
        store_name,
        total_revenue,
        total_profit,
        RANK() OVER (PARTITION BY year, month ORDER BY total_revenue DESC) AS revenue_rank,
        RANK() OVER (PARTITION BY year, month ORDER BY total_profit DESC) AS profit_rank
    FROM StoreMetrics
)
SELECT 
    rm1.year,
    rm1.month_name,
    rm1.store_name AS top_revenue_store,
    ROUND(rm1.total_revenue, 2) AS top_revenue,
    rm2.store_name AS top_profit_store,
    ROUND(rm2.total_profit, 2) AS top_profit
FROM RankedMetrics rm1
JOIN RankedMetrics rm2
    ON rm1.year = rm2.year 
    AND rm1.month = rm2.month
    AND rm2.profit_rank = 1 
WHERE rm1.revenue_rank = 1
ORDER BY rm1.year, rm1.month;

'''
q1_df = pd.read_sql(q1, engine)
q1_df

,year,month_name,top_revenue_store,top_revenue,top_profit_store,top_profit
0,2025.0,January,101 AVE CONVENIENCE STO,55145.64,101 AVE CONVENIENCE STO,13630.83
1,2025.0,February,100-17 BEACH CHANNEL DR,49815.83,101 AVE CONVENIENCE STO,12006.38
2,2025.0,March,1060 GREENE DELI,55543.72,1060 GREENE DELI,13715.61
3,2025.0,April,101 AVE CONVENIENCE STO,51521.34,1064 FUEL,12516.76
4,2025.0,May,1064 FUEL,54944.30,1060 GREENE DELI,13694.32
5,2025.0,June,1066 RUTLAND DELI,53739.89,1066 RUTLAND DELI,13159.32
6,2025.0,July,101 AVE CONVENIENCE STO,56432.68,101 AVE CONVENIENCE STO,13816.62

#### Query 2: Which product categories generate the most revenue and profit?

In [13]:
q2 = '''
WITH CategoryMetrics AS (
    SELECT 
        pc.category_id,
        pc.category_name,
        SUM(sdi.quantity * sdi.actual_unit_price) AS total_revenue,
        SUM(sdi.quantity * (sdi.actual_unit_price - COALESCE(pp.actual_unit_cost, 0) - COALESCE(sdi.discount_amount, 0))) AS total_profit
    FROM product_category pc
    JOIN products p ON pc.category_id = p.category_id
    JOIN sales_detailed_item sdi ON p.product_sku = sdi.product_sku
    LEFT JOIN inventory_lot il ON sdi.lot_id = il.lot_id
    LEFT JOIN purchase_product pp ON il.purchase_product_id = pp.purchase_product_id
    GROUP BY pc.category_id, pc.category_name
)
SELECT 
    category_name,
    ROUND(total_revenue, 2) AS total_revenue,
    ROUND(total_profit, 2) AS total_profit,
    RANK() OVER (ORDER BY total_revenue DESC) AS revenue_rank,
    RANK() OVER (ORDER BY total_profit DESC) AS profit_rank
FROM CategoryMetrics
ORDER BY revenue_rank, profit_rank;
'''

q2_df = pd.read_sql(q2, engine)
q2_df

         category_name  total_revenue  total_profit  revenue_rank  profit_rank
0  Fruits & Vegetables      482623.82     124256.11             1            2
1            Beverages      358450.80     124703.03             2            1
2              Seafood      319427.60      64989.66             3            3
3                Dairy      246944.40      42771.17             4            5
4      Grains & Pulses      196468.35      50940.23             5            4
5          Oils & Fats       98595.50      17100.81             6            6
6               Bakery       92524.35      15874.09             7            7

#### Query 3: What are the total daily sales and refund amounts over time?

In [3]:
# Define total_sale as the quantity sold times the price sold, and then minus the discount amount
# Net_sale = total_sale - total_refund
# Set the day range to every distinct date in the sales_detailed_item table
# Get the total sale and total refund from the corresponding table and then join them using dates

q3 = '''
WITH 
daily_sales AS (
    SELECT 
        DATE(t.tran_time) AS day,
        SUM(sdi.quantity * sdi.actual_unit_price - COALESCE(sdi.discount_amount,0)) AS sales_amount
    FROM sales_detailed_item sdi
    JOIN transactions t ON t.transaction_id = sdi.transaction_id
    GROUP BY DATE(t.tran_time)),

daily_refund AS (
    SELECT 
        DATE(r.refund_time) AS day,
        SUM(r.amount) AS refund_amount
    FROM refunds r
    JOIN sales_detailed_item sdi ON sdi.detailed_id = r.detailed_id
    JOIN transactions t ON t.transaction_id = sdi.transaction_id
    GROUP BY DATE(r.refund_time))
    
SELECT
    s.day,
    COALESCE(s.sales_amount, 0)  AS sales_amount,
    COALESCE(r.refund_amount, 0) AS refund_amount,
    COALESCE(s.sales_amount, 0) - COALESCE(r.refund_amount, 0) AS net_sales
FROM daily_sales s
LEFT JOIN daily_refund r ON s.day = r.day
ORDER BY s.day;
'''

q3_df = pd.read_sql(q3, engine)
q3_df

            day  sales_amount  refund_amount  net_sales
0    2025-01-01       7840.42          11.20    7829.22
1    2025-01-02       8405.74           0.00    8405.74
2    2025-01-03       8019.75          45.19    7974.56
3    2025-01-04       8012.16          34.79    7977.37
4    2025-01-05       8168.96          46.65    8122.31
..          ...           ...            ...        ...
207  2025-07-27       8835.56         528.41    8307.15
208  2025-07-28       8588.83         245.09    8343.74
209  2025-07-29       7896.76         399.60    7497.16
210  2025-07-30       8550.97         529.29    8021.68
211  2025-07-31       8437.92         564.71    7873.21

[212 rows x 4 columns]

#### Query 4: What are the refund amounts/ rate by product and the top refund reasons?

In [4]:
# In order to get the refund amounts and refund rate by product,
# need to calculate the product sales quantity and product sales amount, refund quantity, and refund amount
# combine the sales and refunds to compute the refund rate
# join the product table to show the corresponding product name and product sku

q4_1 = '''
WITH 
product_sales AS (
    SELECT 
        sdi.product_sku,
        SUM(sdi.quantity) AS total_quantity_sold,
        SUM(sdi.quantity * sdi.actual_unit_price - COALESCE(sdi.discount_amount,0)) AS total_sales_amount
    FROM sales_detailed_item sdi
    GROUP BY sdi.product_sku),
    
product_refunds AS (
    SELECT 
        sdi.product_sku,
        SUM(r.quantity) AS total_quantity_refund,
        SUM(r.amount)   AS total_refund_amount
    FROM refunds r
    JOIN sales_detailed_item sdi ON r.detailed_id = sdi.detailed_id
    GROUP BY sdi.product_sku)
    
SELECT 
    ps.product_sku,
    p.product_name,
    COALESCE(pr.total_quantity_refund, 0) AS total_quantity_refund,
    ROUND( COALESCE(pr.total_quantity_refund, 0)::NUMERIC / NULLIF(ps.total_quantity_sold, 0) * 100, 2) AS refund_rate_pct,
    COALESCE(pr.total_refund_amount, 0) AS total_refund_amount
FROM product_sales ps
JOIN products p ON p.product_sku = ps.product_sku
LEFT JOIN product_refunds pr ON ps.product_sku = pr.product_sku
ORDER BY refund_rate_pct DESC;
'''

q4_1_df = pd.read_sql(q4_1, engine)
q4_1_df

,product_sku,product_name,total_quantity_refund,refund_rate_pct,total_refund_amount
0,14-331-3739,Avocado Oil,42.0,12.80,416.79
1,58-005-5343,Cucumber,38.0,11.59,66.84
2,66-327-2821,Palm Oil,31.0,11.44,55.49
3,43-164-5984,Butter,34.0,10.90,97.94
4,87-698-0944,Banana,34.0,10.76,3312.56
...,...,...,...,...,...
985,39-315-3936,Heavy Cream,2.0,0.82,8.00
986,83-400-9746,Mozzarella Cheese,2.0,0.77,14.00
987,11-891-8213,Peanut Oil,2.0,0.76,8.00
988,21-252-1360,Corn Oil,2.0,0.74,4.91
989,77-827-0820,Sesame Oil,1.0,0.69,6.50

In [5]:
# Top refund reasons
q4_2 = '''
SELECT 
    reason,
    COUNT(*) AS refund_count,
    SUM(amount) AS total_refund_amount
FROM refunds
GROUP BY reason
ORDER BY refund_count DESC
'''

q4_2_df = pd.read_sql(q4_2, engine)
q4_2_df

            reason  refund_count  total_refund_amount
0     Changed mind          2367             26433.30
1        Defective          2082             22618.14
2  Quality/Expired          1615             18335.96
3       Wrong item          1189             13293.42
4            Other           825              8657.00

#### Query 5: How many different products and orders has each vendor fulfilled?

In [14]:
q5 = """
WITH fulfilled AS (
  SELECT
    po.vendor_id,
    po.purchase_order_id,
    vp.product_sku
  FROM purchase_product pp
  JOIN purchase_order po ON po.purchase_order_id = pp.purchase_order_id
  JOIN vendor_product vp ON vp.vendor_product_id = pp.vendor_product_id
  WHERE LOWER(po.status) = 'completed'
)
SELECT
  v.vendor_id,
  v.vendor_name,
  COUNT(DISTINCT f.product_sku)        AS products_supplied,
  COUNT(DISTINCT f.purchase_order_id)  AS orders_fulfilled
FROM vendors v
LEFT JOIN fulfilled f ON f.vendor_id = v.vendor_id
GROUP BY v.vendor_id, v.vendor_name
ORDER BY orders_fulfilled DESC, products_supplied DESC;
"""
q5_df = pd.read_sql(q5, engine)
q5_df

,vendor_id,vendor_name,products_supplied,orders_fulfilled
0,3,Edwards Ltd,180,112
1,2,"Matthews, Howard and King",229,103
2,21,"Duran, Bass and Patton",105,88
3,18,Morton Group,185,87
4,1,Smith-Grant,170,87
5,4,"Yu, Scott and Gregory",123,86
6,10,"Coffey, Hernandez and Johnson",120,81
7,5,Gonzalez-Price,93,81
8,12,Smith-Perez,140,80
9,17,Burgess-Orozco,172,76
10,16,"Stephens, Alexander and Kennedy",124,72
11,6,Harrison-Anderson,87,70
12,15,Dennis-Peters,48,61
13,13,"Hartman, Miller and White",88,60
14,8,"Campbell, White and Gutierrez",70,59
15,7,"Jackson, Chapman and Knight",54,59
16,11,"Williamson, Allen and Barker",42,58
17,14,"Bradshaw, Ryan and Oneal",52,54
18,9,Griffin PLC,83,53
19,20,Crawford and Sons,85,52
20,19,Moore LLC,43,50

#### Query 6: Which items in inventory have dropped below their reorder level?

In [6]:
q6 = text("""
    SELECT store_id,
           product_sku,
           quantity_in_stock,
           reorder_threshold
    FROM inventory
    WHERE quantity_in_stock < reorder_threshold
""")

q6_df = pd.read_sql(q6, engine)
q6_df

Empty DataFrame
Columns: [store_id, product_sku, quantity_in_stock, reorder_threshold]
Index: []

#### Query 7: Which products in inventory are closest to their expiration date, and what is their remaining quantity?

In [9]:
# reamining now = received − sold + refunded
q7 = text("""
 SELECT
    il.lot_id,
    il.store_id,
    vp.product_sku,
    il.expiration_date,
    il.quantity
      - COALESCE( (SELECT SUM(sdi.quantity) FROM sales_detailed_item sdi WHERE sdi.lot_id = il.lot_id), 0)
      + COALESCE( (SELECT SUM(r.quantity)
                   FROM refunds r
                   JOIN sales_detailed_item sdi2 ON sdi2.detailed_id = r.detailed_id
                   WHERE sdi2.lot_id = il.lot_id), 0) AS remaining_qty
  FROM inventory_lot il
  JOIN purchase_product pp ON pp.purchase_product_id = il.purchase_product_id
  JOIN vendor_product vp ON vp.vendor_product_id = pp.vendor_product_id
  WHERE il.expiration_date >= date_trunc('month', CURRENT_DATE) AND il.expiration_date < (date_trunc('month', CURRENT_DATE) + interval '1 month')

""")

q7_df = pd.read_sql(q7, engine)
q7_df

     lot_id  store_id  product_sku expiration_date  remaining_qty
0      5974         4  22-895-6595      2025-08-20          344.0
1      1767         1  69-578-7930      2025-08-11          242.0
2      1769         1  69-578-7930      2025-08-14           81.0
3      8084         5  95-354-8583      2025-08-25          142.0
4      1150         1  06-068-6793      2025-08-06           93.0
..      ...       ...          ...             ...            ...
315     598         1  82-380-5378      2025-08-18          293.0
316    3031         2  88-304-2855      2025-08-01          212.0
317    7009         4  68-973-8812      2025-08-18          277.0
318    4844         3  41-240-8856      2025-08-02           51.0
319     166         1  77-312-6317      2025-08-06          376.0

[320 rows x 5 columns]

#### Query 8: Which employees generate the highest revenue per labor hour each month, and how do they compare to the store average?

In [15]:
q8 = """
WITH emp_tx_days AS (
  SELECT
    t.employee_id,
    e.store_id,
    EXTRACT(YEAR  FROM t.tran_time) AS year,
    EXTRACT(MONTH FROM t.tran_time) AS month,
    TO_CHAR(t.tran_time, 'Month')   AS month_name,
    COUNT(DISTINCT DATE(t.tran_time)) AS days_worked
  FROM transactions t
  JOIN employees e ON e.employee_id = t.employee_id
  GROUP BY t.employee_id, e.store_id,
           EXTRACT(YEAR  FROM t.tran_time),
           EXTRACT(MONTH FROM t.tran_time),
           TO_CHAR(t.tran_time, 'Month')
),
shift_len AS (
  SELECT
    s.employee_id,
    CASE
      WHEN s.schedule_end >= s.schedule_start
        THEN EXTRACT(EPOCH FROM (s.schedule_end - s.schedule_start))/3600.0
      ELSE EXTRACT(EPOCH FROM ((s.schedule_end - s.schedule_start) + INTERVAL '24 hours'))/3600.0
    END AS shift_hours
  FROM shifts s
),
emp_hours AS (
  SELECT
    d.employee_id, d.store_id, d.year, d.month, d.month_name,
    (d.days_worked * sl.shift_hours) AS labor_hours
  FROM emp_tx_days d
  JOIN shift_len sl ON sl.employee_id = d.employee_id
),
emp_rev AS (
  SELECT
    t.employee_id,
    EXTRACT(YEAR  FROM t.tran_time) AS year,
    EXTRACT(MONTH FROM t.tran_time) AS month,
    TO_CHAR(t.tran_time, 'Month')   AS month_name,
    SUM(sdi.quantity * sdi.actual_unit_price - COALESCE(sdi.discount_amount,0)) AS revenue
  FROM transactions t
  JOIN sales_detailed_item sdi ON sdi.transaction_id = t.transaction_id
  GROUP BY t.employee_id,
           EXTRACT(YEAR  FROM t.tran_time),
           EXTRACT(MONTH FROM t.tran_time),
           TO_CHAR(t.tran_time, 'Month')
),
emp_metrics AS (
  SELECT
    eh.employee_id, eh.store_id, eh.year, eh.month, eh.month_name,
    COALESCE(er.revenue, 0) AS revenue,
    eh.labor_hours,
    CASE WHEN eh.labor_hours > 0 THEN COALESCE(er.revenue,0) / eh.labor_hours END AS revenue_per_hour
  FROM emp_hours eh
  LEFT JOIN emp_rev er
    ON er.employee_id = eh.employee_id AND er.year = eh.year AND er.month = eh.month
),
store_avgs AS (
  SELECT store_id, year, month, AVG(revenue_per_hour) AS store_avg_rph
  FROM emp_metrics
  GROUP BY store_id, year, month
),
ranked AS (
  SELECT
    em.*,
    e.first_name || ' ' || e.last_name AS employee_name,
    s.store_name,
    RANK() OVER (PARTITION BY em.year, em.month ORDER BY em.revenue_per_hour DESC) AS rnk
  FROM emp_metrics em
  JOIN employees e ON e.employee_id = em.employee_id
  JOIN stores s    ON s.store_id    = em.store_id
)
SELECT
  r.year,
  r.month_name,
  r.employee_id,
  r.employee_name,
  r.store_name,
  ROUND(r.revenue::numeric,2)            AS revenue,
  ROUND(r.labor_hours::numeric,2)        AS labor_hours,
  ROUND(r.revenue_per_hour::numeric,2)   AS revenue_per_hour,
  ROUND(sa.store_avg_rph::numeric,2)     AS store_avg_revenue_per_hour,
  ROUND((r.revenue_per_hour - sa.store_avg_rph)::numeric,2) AS diff_from_store_avg
FROM ranked r
JOIN store_avgs sa
  ON sa.store_id = r.store_id AND sa.year = r.year AND sa.month = r.month
WHERE r.rnk = 1
ORDER BY r.year, r.month;
"""
q8_df = pd.read_sql(q8, engine)
q8_df

,year,month_name,employee_id,employee_name,store_name,revenue,labor_hours,revenue_per_hour,store_avg_revenue_per_hour,diff_from_store_avg
0,2025.0,January,28,Nancy Miller,1060 GREENE DELI,28255.01,248.0,113.93,104.13,9.80
1,2025.0,February,3,Sean Peters,100-17 BEACH CHANNEL DR,26535.57,224.0,118.46,105.26,13.20
2,2025.0,March,18,Linda Avila,101 AVE CONVENIENCE STO,27985.77,248.0,112.85,112.13,0.71
3,2025.0,April,14,Johnny Tate,101 AVE CONVENIENCE STO,25977.00,240.0,108.24,106.66,1.58
4,2025.0,May,40,Nicole Patterson,1064 FUEL,27595.72,248.0,111.27,105.38,5.90
5,2025.0,June,38,Whitney Williams,1064 FUEL,27576.48,240.0,114.90,109.19,5.72
6,2025.0,July,40,Nicole Patterson,1064 FUEL,28446.80,248.0,114.70,106.86,7.84

#### Query 9: What products are most frequently purchased together in the same transaction?

In [17]:
q9 = """
WITH items AS (
  SELECT DISTINCT transaction_id, product_sku
  FROM sales_detailed_item
),
pairs AS (
  SELECT
    i1.product_sku AS sku_1,
    i2.product_sku AS sku_2,
    COUNT(*)       AS pair_count
  FROM items i1
  JOIN items i2
    ON i1.transaction_id = i2.transaction_id
   AND i1.product_sku   < i2.product_sku
  GROUP BY i1.product_sku, i2.product_sku
)
SELECT
  p1.product_name AS product_1,
  p2.product_name AS product_2,
  pairs.pair_count
FROM pairs
JOIN products p1 ON p1.product_sku = pairs.sku_1
JOIN products p2 ON p2.product_sku = pairs.sku_2
ORDER BY pairs.pair_count DESC
LIMIT 10;
"""
q9_df = pd.read_sql(q9, engine)
q9_df

           product_1       product_2  pair_count
0          Mushrooms     Bread Flour           5
1        Bread Flour  Powdered Sugar           5
2        Blueberries       Anchovies           5
3          Black Tea            Kale           5
4  Whole Wheat Bread        Sardines           5
5          Olive Oil    Black Coffee           5
6        White Sugar  Powdered Sugar           5
7      Coconut Sugar            Plum           4
8                Cod        Eggplant           4
9     Cheddar Cheese     White Sugar           4

#### Query 10: What are the monthly operating expenses per store and which expense type is the highest?

In [18]:
q10 = """
WITH monthly AS (
  SELECT
    oe.store_id,
    EXTRACT(YEAR  FROM oe.expense_date) AS year,
    EXTRACT(MONTH FROM oe.expense_date) AS month,
    TO_CHAR(oe.expense_date,'Month')    AS month_name,
    oe.expense_type,
    SUM(oe.amount) AS expense_amount
  FROM operating_expenses oe
  GROUP BY oe.store_id,
           EXTRACT(YEAR  FROM oe.expense_date),
           EXTRACT(MONTH FROM oe.expense_date),
           TO_CHAR(oe.expense_date,'Month'),
           oe.expense_type
),
store_month_totals AS (
  SELECT
    store_id, year, month, month_name,
    SUM(expense_amount) AS total_expense
  FROM monthly
  GROUP BY store_id, year, month, month_name
),
ranked_types AS (
  SELECT
    m.*,
    RANK() OVER (PARTITION BY m.store_id, m.year, m.month
                 ORDER BY m.expense_amount DESC) AS type_rank
  FROM monthly m
)
SELECT
  smt.store_id,
  s.store_name,
  smt.year,
  smt.month_name,
  ROUND(smt.total_expense::numeric,2) AS total_expense,
  rt.expense_type                     AS top_expense_type,
  ROUND(rt.expense_amount::numeric,2) AS top_expense_amount
FROM store_month_totals smt
JOIN stores s   ON s.store_id  = smt.store_id
JOIN ranked_types rt
  ON rt.store_id = smt.store_id AND rt.year = smt.year AND rt.month = smt.month
WHERE rt.type_rank = 1
ORDER BY smt.year, smt.month, smt.store_id;
"""
q10_df = pd.read_sql(q10, engine)
q10_df

,store_id,store_name,year,month_name,total_expense,top_expense_type,top_expense_amount
0,1,100-17 BEACH CHANNEL DR,2025.0,January,7965.56,Rent,6679.50
1,2,101 AVE CONVENIENCE STO,2025.0,January,7408.53,Rent,5736.76
2,3,1060 GREENE DELI,2025.0,January,9088.34,Rent,7811.62
3,4,1064 FUEL,2025.0,January,6936.63,Rent,5512.52
4,5,1066 RUTLAND DELI,2025.0,January,8633.72,Rent,7538.16
5,1,100-17 BEACH CHANNEL DR,2025.0,February,8492.44,Rent,6679.50
6,2,101 AVE CONVENIENCE STO,2025.0,February,7244.43,Rent,5736.76
7,3,1060 GREENE DELI,2025.0,February,10170.61,Rent,7811.62
8,4,1064 FUEL,2025.0,February,6434.61,Rent,5512.52
9,5,1066 RUTLAND DELI,2025.0,February,8381.05,Rent,7538.16
10,1,100-17 BEACH CHANNEL DR,2025.0,March,7683.79,Rent,6679.50
11,2,101 AVE CONVENIENCE STO,2025.0,March,7419.86,Rent,5736.76
12,3,1060 GREENE DELI,2025.0,March,8729.10,Rent,7811.62
13,4,1064 FUEL,2025.0,March,6732.62,Rent,5512.52
14,5,1066 RUTLAND DELI,2025.0,March,8816.93,Rent,7538.16
15,1,100-17 BEACH CHANNEL DR,2025.0,April,7976.20,Rent,6679.50
16,2,101 AVE CONVENIENCE STO,2025.0,April,6554.56,Rent,5736.76
17,3,1060 GREENE DELI,2025.0,April,9200.71,Rent,7811.62
18,4,1064 FUEL,2025.0,April,7279.89,Rent,5512.52
19,5,1066 RUTLAND DELI,2025.0,April,8859.04,Rent,7538.16
20,1,100-17 BEACH CHANNEL DR,2025.0,May,8380.90,Rent,6679.50
21,2,101 AVE CONVENIENCE STO,2025.0,May,7103.46,Rent,5736.76
22,3,1060 GREENE DELI,2025.0,May,8409.80,Rent,7811.62
23,4,1064 FUEL,2025.0,May,6640.47,Rent,5512.52
24,5,1066 RUTLAND DELI,2025.0,May,8635.35,Rent,7538.16
25,1,100-17 BEACH CHANNEL DR,2025.0,June,8044.96,Rent,6679.50
26,2,101 AVE CONVENIENCE STO,2025.0,June,6642.61,Rent,5736.76
27,3,1060 GREENE DELI,2025.0,June,9133.45,Rent,7811.62
28,4,1064 FUEL,2025.0,June,6249.14,Rent,5512.52
29,5,1066 RUTLAND DELI,2025.0,June,9021.80,Rent,7538.16
30,1,100-17 BEACH CHANNEL DR,2025.0,July,7996.51,Rent,6679.50
31,2,101 AVE CONVENIENCE STO,2025.0,July,7527.66,Rent,5736.76
32,3,1060 GREENE DELI,2025.0,July,8961.30,Rent,7811.62
33,4,1064 FUEL,2025.0,July,6775.81,Rent,5512.52
34,5,1066 RUTLAND DELI,2025.0,July,9419.73,Rent,7538.16